# 로지스틱 회귀분석 경사하강법

a = 0
b = 0
c = 0

eta = 0.0000075

while True:
    new_a = a - eta * (2 * (a * 40 + b * 30 + c - 1) * 40 +
                       2 * (a * 30 + b * 80 + c + 1) * 30 +
                       2 * (a * 20 + b * 70 + c + 1) * 20 +
                       2 * (a * 70 + b * 40 + c - 1) * 70 +
                       2 * (a * 60 + b * 20 + c - 1) * 60)

    new_b = b - eta * (2 * (a * 40 + b * 30 + c - 1) * 40 +
                       2 * (a * 30 + b * 80 + c + 1) * 30 +
                       2 * (a * 20 + b * 70 + c + 1) * 20 +
                       2 * (a * 70 + b * 40 + c - 1) * 70 +
                       2 * (a * 60 + b * 20 + c - 1) * 60)

    new_c = c - eta * (2 * (a * 40 + b * 30 + c - 1) +
                       2 * (a * 30 + b * 80 + c + 1) +
                       2 * (a * 20 + b * 70 + c + 1) +
                       2 * (a * 70 + b * 40 + c - 1) +
                       2 * (a * 60 + b * 20 + c - 1))

    # a = 0.01617
    # b = -0.03088
    # c = 0.97058

    if a == new_a:
        break

    a = new_a
    b = new_b
    c = new_c

    print('a : %.12f, b : %.12f, c : %.12f' % (a, b, c))



print('최종 a값 : ', a)
print('최종 b값 : ', b)
print('최종 c값 : ', c)